nvhung1609/YTB/MSP430/10.DHT11 and LED 7SEG/code/main.c

#include "msp430g2553.h"
#include "dht11.h"

#define DATA BIT0
#define LATCH BIT1
#define CLK BIT2

#define OUT595 P1OUT

long cout = 1;
int coutnum = 0;

char DATA_8LED[8] = {0, 0, 0, 0, 0, 0, 0, 0};
char SCAN[8] = {0x01, 0x02, 0x04, 0x08, 0x10, 0x20, 0x40, 0x80};
char led7[10] = {0xC0, 0xF9, 0xA4, 0xB0, 0x99, 0x92, 0x82, 0xF8, 0x80, 0x90};

void outByte(unsigned char hex, int latch);
void hien_thi(long long num);
void Scan_8LED(void);
void init_timer(void);

void main(void)
{
  WDTCTL = WDTPW + WDTHOLD;
  
  BCSCTL1 = CALBC1_1MHZ;
  DCOCTL = CALDCO_1MHZ;
  
  init_timer();//khoi tao timer de quet led
  
  P1DIR |= (DATA + LATCH + CLK);//khai bao cac chan ngo ra co ic ghi dich 74HC595
  
  _BIS_SR(GIE);//cho phep ngat toan cuc
  
  while (1)
  {
    readDHT11();//get du lieu dht11
    
    hien_thi((nhietDo*100) + doAm);//hien thi ra led 7 doan
    
    __delay_cycles(100000);
  }
}

void outByte(unsigned char hex, int latch)
{
  for (char i = 0; i < 8; i++)
  {
    if ((hex << i) & 0x80)
    {
      OUT595 |= DATA;
    }
    else
    {
      OUT595 &= ~DATA;
    }
    OUT595 |= CLK;
    OUT595 &= ~CLK;
  }
  if (latch)
  {
    OUT595 &= ~LATCH;
    OUT595 |= LATCH;
  }
}

void hien_thi(long long num)
{
  for (int i = 0; i < 8; i++)
  {
    if (num >= cout)
    {
      cout *= 10;
      coutnum += 1;
    }
  }
  for (int n = 0; n < coutnum; n++)
  {
    DATA_8LED[n] = num % 10;
    num /= 10;
  }
}

void Scan_8LED(void)
{
  for (int i = 0; i < coutnum; i++)
  {
    outByte(led7[DATA_8LED[i]], 0);
    outByte(SCAN[i], 1);
    outByte(0xff, 0);
    outByte(0xff, 1);
  }
}

void init_timer(void)
{
  TACCR0 = 3000;
  TACCTL0 |= CCIE;
  TACTL |= (TASSEL_2 + MC_1 + ID_3);
}

#pragma vector = TIMER0_A0_VECTOR
__interrupt void Timer_A(void)
{
  Scan_8LED();
}
